# X - §Þ§Ñ§ã§ã§Ú§Ó(§Ó§Ö§Ü§ä§à§â)
# Y - §Þ§Ñ§ã§ã§Ú§Ó(§Ó§Ö§Ü§ä§à§â)
# x - §é§Ú§ã§Ý§à
function [f] = NearNeighb(X,Y,x)
  # §á§â§à§ç§à§Õ§Ú§Þ§ã§ñ §á§à §Ó§ã§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ X §ß§Ö §Ó§Ü§Ý§ð§é§Ñ§ñ §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à
  for j=1:1:length(X)-1
    # §á§â§à§Ó§Ö§â§ñ§Ö§Þ, §Þ§Ö§ß§î§ê§Ö §Ý§Ú §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §é§Ú§ã§Ý§Ñ §Ó§Ö§Ü§ä§à§â§Ñ X §ß§Ñ §á§à§Ù§Ú§è§Ú§Ú j, §é§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §á§Ö§â§Ö§Õ§Ñ§ß§ß§à§Ö §Ó x §Ú §Þ§Ö§ß§î§ê§Ö §Ý§Ú §á§Ö§â§Ö§Õ§Ñ§ß§ß§à§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §é§Ö§Þ §ã§Ý§Ö§Õ§å§ð§ë§Ö§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §Ó§Ö§Ü§ä§à§â§Ñ X
    if (X(j) < x) && (x <= X(j+1))
        # §å§ã§ä§Ñ§ß§Ñ§Ó§Ý§Ú§Ó§Ñ§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö f §á§à §é§Ú§ã§Ý§å §Ó§Ö§Ü§ä§à§â§Ñ Y
        f=Y(j);
        # §Ó§í§ç§à§Õ§Ú§Þ §Ú§Ù §è§Ú§Ü§Ý§Ñ
        break;
    endif;# §Ü§à§ß§Ö§è if...else §Ò§Ý§à§Ü§Ñ
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
  # §Ö§ã§Ý§Ú §Ù§ß§Ñ§é§Ö§ß§Ú§Ö x §Þ§Ö§ß§î§ê§Ö §Ú§Ý§Ú §â§Ñ§Ó§ß§à §Ù§ß§Ñ§é§Ö§ß§Ú§ð §á§Ö§â§Ó§à§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ, §ä§à f §å§ã§ä§Ñ§ß§Ñ§Ó§Ý§Ú§Ó§Ñ§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §á§Ö§â§Ó§à§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ §Ó§Ö§Ü§ä§à§â§Ñ Y
  if (x<=X(1)) f=Y(1); end;
  # §Ö§ã§Ý§Ú §Ó§Õ§â§å§Ô §á§Ö§â§Ö§Õ§Ñ§ß§ß§à§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö x §à§Ü§Ñ§Ø§Ö§ä§ã§ñ §Ò§à§Ý§î§ê§Ö §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ X, §ä§à §Ó f §å§ã§ä§Ñ§ß§Ñ§Ó§Ý§Ú§Ó§Ñ§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ §Ó§Ö§Ü§ä§à§â§Ñ Y
  if (x>X(length(X))) f=Y(length(X));  end;
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
