# z - §Þ§Ñ§ã§ã§Ú§Ó (§Ó§Ö§Ü§ä§à§â)
function[f] = slidingAveraging(z)
  # §á§Ö§â§Ö§Þ§Ö§ß§ß§Ñ§ñ §ã §Õ§Ý§Ú§ß§à§Û z
  n=length(z);
  # §á§â§à§ç§à§Õ§Ú§Þ§ã§ñ §á§à §Ó§ã§Ö§Þ §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ§Þ §ß§Ñ§é§Ú§ß§Ñ§ñ §ã 4-§à§Ô§à §Ú §Ù§Ñ§Ü§Ñ§ß§é§Ú§Ó§Ñ§ñ 3-§Ú§Þ §Õ§à §Ü§à§ß§è§Ñ. (§ä§Ñ§Ü §Ü§Ñ§Ü §Ú§ß§Ñ§é§Ö §ã §à§Ü§ß§à§Þ §ã§Ö§Þ§î §Þ§í §á§à§Ý§å§é§Ú§Þ §à§ê§Ú§Ò§Ü§å §Ó§à §Ó§â§Ö§Þ§ñ §Ó§í§á§à§Ý§ß§Ö§ß§Ú§ñ)
  for j=4:1:n-3
    f(j)=(z(j-3)+z(j-2)+z(j-1)+z(j)+z(j+1)+z(j+2)+z(j+3))/7;
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
  # §Ù§Ñ§á§à§Ý§ß§ñ§Ö§Þ §ß§Ö§Ù§Ñ§á§à§Ý§ß§Ö§ß§ß§í§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ§Þ§Ú §Ú§Ù §à§â§Ú§Ô§Ú§ß§Ñ§Ý§î§ß§à§Ô§à §Þ§Ñ§ã§ã§Ú§Ó§Ñ z
  for j=1:1:3
    f(j)=z(j);
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
  for j=n:-1:n-2
    f(j)=z(j);
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú