function[totalMult, countAbsMoreThan3] = task3()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §ã§é§Ú§ä§í§Ó§Ñ§Ö§Þ §ã §Ü§Ý§Ñ§Ó§Ú§Ñ§ä§å§â§í §Ú §Õ§Ñ§×§Þ §á§à§Õ§ã§Ü§Ñ§Ù§å §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ð. ('s' §ß§å§Ø§ß§à §é§ä§à§Ò§í §ã§é§Ú§ä§Ñ§ß§ß§í§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ò§í§Ý§Ú §ã§ä§â§à§Ü§à§Û)
  readed = input('§£§Ó§Ö§Õ§Ú§ä§Ö §é§Ú§ã§Ý§à(§Ú§Ý§Ú exit §Õ§Ý§ñ §Ó§í§ç§à§Õ§Ñ): ', 's')
  # §Ú§ß§Ú§è§Ú§Ñ§Ý§Ú§Ù§Ú§â§å§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§å§ð §Õ§Ý§ñ §á§â§à§Ú§Ù§Ó§Ö§Õ§Ö§ß§Ú§ñ §Ú §ã§é§×§ä§é§Ú§Ü §é§Ú§ã§Ö§Ý, §Õ§Ý§ñ §é§Ú§ã§Ö§Ý §Ò§à§Ý§î§ê§Ö 3 §á§à §Þ§à§Õ§å§Ý§ð
  totalMult = 1
  countAbsMoreThan3 = 0
  # §Õ§Ö§Ý§Ñ§Ö§Þ §é§ä§à-§ä§à §á§à§Ü§Ñ §ã§é§Ú§ä§Ñ§ß§ß§í§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §ß§Ö §â§Ñ§Ó§ß§í exit, §Ü§Ñ§Ü §ä§à§Ý§î§Ü§à §â§Ñ§Ó§ß§í, §ä§Ñ§Ü §ã§â§Ñ§Ù§å §è§Ú§Ü§Ý §á§â§Ö§â§í§Ó§Ñ§Ö§ä§ã§ñ
  while (strcmp(readed, 'exit') == 0)
    # §å§Þ§ß§à§Ø§Ñ§Ö§Þ §ß§Ñ§ê§Ö §é§Ú§ã§Ý§à (§á§â§à§Ú§Ù§Ó§Ö§Õ§Ö§ß§Ú§Ö §Ó§ã§Ö§ç §é§Ú§ã§Ö§Ý)
    totalMult *= str2double(readed)
    # §Ö§ã§Ý§Ú §Þ§à§Õ§å§Ý§î §é§Ú§ã§Ý§Ñ §Ò§à§Ý§î§ê§Ö 3-§×§ç, §ä§à §å§Ó§Ö§Ý§Ú§é§Ú§Ó§Ñ§Ö§Þ §ã§é§×§ä§é§Ú§Ü §é§Ú§ã§Ö§Ý §Ò§à§Ý§î§ê§Ö 3-§×§ç §á§à §Þ§à§Õ§å§Ý§ð
    if (abs(str2double(readed)) > 3)
      countAbsMoreThan3++
    endif; # §Ü§à§ß§Ö§è if...else §Ò§Ý§à§Ü§Ñ 
    # §ã§é§Ú§ä§í§Ó§Ñ§Ö§Þ §ã §Ü§Ý§Ñ§Ó§Ú§Ñ§ä§å§â§í §Ú §Õ§Ñ§×§Þ §á§à§Õ§ã§Ü§Ñ§Ù§å §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ð. ('s' §ß§å§Ø§ß§à §é§ä§à§Ò§í §ã§é§Ú§ä§Ñ§ß§ß§í§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ò§í§Ý§Ú §ã§ä§â§à§Ü§à§Û)
    readed = input('§£§Ó§Ö§Õ§Ú§ä§Ö §é§Ú§ã§Ý§à(§Ú§Ý§Ú exit §Õ§Ý§ñ §Ó§í§ç§à§Õ§Ñ): ', 's')
  endwhile;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
