function[] = task2()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ó§ã§Ö§Ô§à §Ý§Ú§ê§ß§Ö§Ô§à
  clear all;
  # §±§Ñ§â§Ñ§Þ§Ö§ä§â§í
  x = 1:1:10
  # §á§â§Ú§Þ§Ö§ß§ñ§Ö§Þ §ß§Ñ§ê§å §æ§å§ß§Ü§è§Ú§ð §Õ§Ý§ñ §Ü§Ñ§Ø§Õ§à§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ x
  for k=1:1:length(x)
    z(k) = funForTask2(x(k))
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
  # §ã§Ô§Ý§Ñ§Ø§Ú§Ó§Ñ§Ö§Þ §Õ§Ñ§ß§ß§í§Ö §Ú §Ù§Ñ§á§Ú§ã§í§Ó§Ñ§Ö§Þ §Ó §á§Ö§â§Ö§Þ§Ö§ß§ß§å§ð Smoothed
  Smoothed = slidingAveraging(z)
  # §£§í§é§Ú§ä§Ñ§Ö§Þ §Ú§Ù §à§â§Ú§Ô§Ú§ß§Ñ§Ý§î§ß§í§ç §Õ§Ñ§ß§ß§í§ç §ã§Ô§Ý§Ñ§Ø§Ö§ß§ß§í§Ö §Õ§Ñ§ß§ß§í§Ö 
  OriginalMinSmoothed = z - Smoothed
  # §³§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü §Ú§Ù: §ã§Ô§Ý§Ñ§Ø§Ö§ß§ß§í§ç §Õ§Ñ§ß§ß§í§ç §Ú §à§â§Ú§Ô§Ú§ß§Ñ§Ý§î§ß§í§ç §Ù§Ñ §Ó§í§é§Ö§ä§à§Þ §ã§Ô§Ý§Ñ§Ø§Ö§ß§ß§í§ç §Õ§Ñ§ß§ß§í§ç
  plot(x, Smoothed, 'k',  x, OriginalMinSmoothed, 'g')
  # §¯§Ñ§Õ§á§Ú§ã§î §ß§Ñ§Õ §â§Ú§ã§å§ß§Ü§à§Þ(§ß§Ñ§Ù§Ó§Ñ§ß§Ú§Ö)
  title('Z = sin(0.3*x)+0.2*sin(8,3*x)');
  # §±§à§Õ§á§Ú§ã§î §à§ã§Ú x §Ú y
  xlabel('Ox');
  ylabel('Oz');
  # §£§Ü§Ý§ð§é§Ö§ß§Ú§Ö §à§ä§à§Ò§â§Ñ§Ø§Ö§ß§Ú§Ö §ã§Ö§ä§Ü§Ú
  grid on;
  # §£§í§Ó§à§Õ§Ú§Þ §Ó §Ü§à§ß§ã§à§Ý§î §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §à§â§Ú§Ô§Ú§ß§Ñ§Ý§î§ß§í§ç §Ù§Ñ §Ó§í§é§Ö§ä§à§Þ §ã§Ô§Ý§Ñ§Ø§Ö§ß§ß§í§ç §Õ§Ñ§ß§ß§í§ç §á§â§Ú §Ü§à§ä§à§â§í§ç X = 5
  disp(OriginalMinSmoothed(find(x == 5)))
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú