function[minValue, position] = task4()
  # §é§Ú§ã§ä§Ú§Ş §à§ä §İ§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §ã§é§Ú§ä§í§Ó§Ñ§Ö§Ş §ã §Ü§İ§Ñ§Ó§Ú§Ñ§ä§å§â§í §Ú §Õ§Ñ§×§Ş §á§à§Õ§ã§Ü§Ñ§Ù§å §á§à§İ§î§Ù§à§Ó§Ñ§ä§Ö§İ§ğ. ('s' §ß§å§Ø§ß§à §é§ä§à§Ò§í §ã§é§Ú§ä§Ñ§ß§ß§í§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ò§í§İ§Ú §ã§ä§â§à§Ü§à§Û)
  readed = input('§£§Ó§Ö§Õ§Ú§ä§Ö §é§Ö§ä§í§â§×§ç§Ù§ß§Ñ§é§ß§à§Ö §é§Ú§ã§İ§à: ')
  # §á§â§à§Ó§Ö§â§Ü§Ñ §ß§Ñ §ä§à, §é§Ö§ä§í§â§×§ç§Ù§ß§Ñ§é§ß§à§Ö §İ§Ú §é§Ú§ã§İ§à
  if (readed >= 10000 | readed < 1000)
    # §Ó§í§Ó§à§Õ §á§à§İ§î§Ù§à§Ó§Ñ§ä§Ö§İ§ğ §Ú§ß§æ§à§â§Ş§Ñ§è§Ú§Ú §à §ä§à§Ş, §Ô§Õ§Ö §à§ß §Õ§à§á§å§ã§ä§Ú§İ §à§ê§Ú§Ò§Ü§å
    disp('§£ §ã§İ§Ö§Õ§å§ğ§ë§Ú§Û §â§Ñ§Ù §Ó§Ó§à§Õ§Ú§ä§Ö §é§Ö§ä§í§â§×§ç§Ù§ß§Ñ§é§ß§à§Ö §é§Ú§ã§İ§à')
    return;# §Ó§í§ç§à§Õ §Ú§Ù §æ§å§ß§Ü§è§Ú§Ú
  endif;# §Ü§à§ß§Ö§è if...else §Ò§İ§à§Ü§Ñ
  # §Ú§ß§Ú§è§Ú§Ñ§İ§Ú§Ù§Ú§â§å§Ö§Ş §á§Ö§â§Ö§Ş§Ö§ß§ß§í§Ö §Õ§İ§ñ §Ş§Ú§ß§Ú§Ş§Ñ§İ§î§ß§à§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ú §á§à§Ù§Ú§è§Ú§Ú §ï§İ§Ö§Ş§Ö§ß§ä§Ñ §ã §Ş§Ú§ß§Ú§Ş§Ñ§İ§î§ß§í§Ş §Ù§ß§Ñ§é§Ö§ß§Ú§Ö§Ş. (§Õ§Ö§İ§Ñ§Ö§Ş §Ú§ç §Ò§à§İ§î§ê§Ö §Ş§Ñ§Ü§ã§Ú§Ş§Ñ§İ§î§ß§à§Ô§à)
  minValue = 10
  position = 5
  # §á§à§ã§Ü§à§İ§î§Ü§å §Ó§ã§× §Õ§Ö§İ§Ñ§Ö§ä§ã§ñ §é§Ö§â§Ö§Ù mod §Ú §è§Ú§Ü§İ, §ä§à §ß§Ñ§Õ§à §ã§Õ§Ö§İ§Ñ§ä§î §Õ§â§å§Ô§à§Û §ã§é§×§ä§é§Ú§Ü §á§à§Ù§Ú§è§Ú§Û
  realPosition = 4
  # §è§Ú§Ü§İ §ß§Ñ 4 §ê§Ñ§Ô§Ñ, §é§ä§à§Ò§í §á§â§à§Û§ä§Ú§ã§î §á§à §é§Ö§ä§í§â§×§ç§Ù§ß§Ñ§é§ß§à§Ş§å §é§Ú§ã§İ§à
  for k=1:1:4
    # §á§à§İ§å§é§Ñ§Ö§Ş §à§ã§ä§Ñ§ä§à§Ü §à§ä §Õ§Ö§İ§Ö§ß§Ú§ñ §ß§Ñ 10. (§Ô§â§å§Ò§à §Ô§à§Ó§à§â§ñ §á§à§ã§İ§Ö§Õ§ß§ğ§ğ §è§Ú§æ§â§å §ß§Ñ§ê§Ö§Ô§à §é§Ú§ã§İ§Ñ)
    toCheck = mod(readed, 10)
    # §Ö§ã§İ§Ú §é§Ú§ã§İ§à(§è§Ú§æ§â§Ñ) §Ş§Ö§ß§î§ê§Ö §Ş§Ú§ß§Ú§Ş§Ñ§İ§î§ß§à§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ, §ä§à §å§ã§ä§Ñ§ß§Ñ§Ó§İ§Ú§Ó§Ñ§Ö§Ş §á§à§Ù§Ú§è§Ú§ğ §Ú §Ş§Ú§ß§Ú§Ş§Ñ§İ§î§ß§à§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö§Ş §Õ§İ§ñ §Õ§Ñ§ß§ß§à§Ô§à §é§Ú§ã§İ§Ñ(§è§Ú§æ§â§í)
    if (toCheck < minValue)
      minValue = toCheck
      position = realPosition
    endif;# §Ü§à§ß§Ö§è if...else §Ò§İ§à§Ü§Ñ
    # §Õ§Ö§İ§Ú§Ş §é§Ú§ã§İ§à §ß§Ñ 10 §Ú §à§ä§Ò§â§Ñ§ã§í§Ó§Ñ§Ö§Ş §Õ§â§à§Ò§ß§å§ğ §é§Ñ§ã§ä§î
    readed =  fix(readed ./ 10)
    # §ä§Ñ§Ü §Ü§Ñ§Ü §ã§İ§Ö§Õ§å§ğ§ë§Ö§Ö §é§Ú§ã§İ§à §á§à§ã§İ§Ö mod §Ò§å§Õ§Ö§ä §ß§Ñ 1 §Ş§Ö§ß§î§ê§Ö, §ä§à §Ú §â§Ö§Ñ§İ§î§ß§å§ğ §á§à§Ù§Ú§è§Ú§ğ §Ş§í §Õ§à§İ§Ø§ß§í §ã§Õ§Ö§İ§Ñ§ä§î §ß§Ñ §à§Õ§ß§å §Ş§Ö§ß§î§ê§Ö
    realPosition--
  endfor;# §Ü§à§ß§Ö§è §è§Ú§Ü§İ§Ñ
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú