function[] = task1()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ó§ã§Ö§Ô§à §Ý§Ú§ê§ß§Ö§Ô§à
  clear all;
  # §ã§à§Ù§Õ§Ñ§×§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§í§Ö §ã§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ§Þ§Ú §Ú§Ù §Ù§Ñ§Õ§Ñ§ß§Ú§ñ
  w = [4, 2, 6, 1, 0, 3, 2, 5, 3, 4]
  x = 1:1:10
  # §ã§à§Ù§Õ§Ñ§×§Þ §ä§à§é§Ü§Ú x, §ß§à §ã §Þ§Ö§ß§î§ê§Ú§Þ §ê§Ñ§Ô§à§Þ
  X = 1:0.1:11
  # §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü§Ú §Ú §Ó§í§á§à§Ý§ß§ñ§Ö§Þ §Ú§ß§ä§Ö§â§á§à§Ý§ñ§è§Ú§ð §Þ§Ö§ä§à§Õ§à§Þ §Ò§Ý§Ú§Ø§Ñ§Û§ê§Ö§Ô§à §ã§à§ã§Ö§Õ§Ñ §Ú §Ü§å§Ò§Ú§é§Ö§ã§Ü§à§Ô§à §ã§á§Ý§Ñ§Û§ß§Ñ
  # §ã§à§Ù§Õ§Ñ§×§Þ §ß§à§Ó§å§ð §æ§Ú§Ô§å§â§å (§à§Ü§ß§à)
  figure();
  interpNear = interp1(x, w, X, 'nearest')
  interpSpline = interp1(x, w, X, 'spline')
  plot(X, interpNear, X, interpSpline)
  # §Õ§Ö§Ý§Ñ§Ö§Þ §ß§Ñ§Õ§á§Ú§ã§î §ß§Ñ§Õ §Ô§â§Ñ§æ§Ú§Ü§à§Þ
  title('Spline and nearest matlab methods');
  grid on;# §á§à§Ü§Ñ§Ù§í§Ó§Ñ§Ö§Þ §ã§Ö§ä§Ü§å
  # §ã§à§Ù§Õ§Ñ§×§Þ §ß§à§Ó§å§ð §æ§Ú§Ô§å§â§å (§à§Ü§ß§à)
  figure();
  # §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü§Ú §á§â§à§Ú§Ù§Ó§à§Õ§ß§í§ç(§Ó§ß§å§ä§â§Ú §Ö§ã§ä§î §á§à§Õ§á§å§ß§Ü§ä§í, §ß§å §Ú §æ§å§ß§Ü§è§Ú§ñ diff §ß§å§Ø§ß§Ñ §Õ§Ý§ñ §ß§Ñ§ç§à§Ø§Õ§Ö§ß§Ú§ñ §á§â§à§Ú§Ù§Ó§à§Õ§ß§í§ç)
  # §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§Þ §Ü §Õ§Ö§æ§à§Ý§ä§å
  hold off;
  plot(diff(interpNear))
  # §ã§à§ç§â§Ñ§ß§ñ§Ö§Þ §Õ§Ñ§ß§ß§í§Ö §ß§Ñ §Ô§â§æ§Ú§Ü§Ö §Õ§Ý§ñ §á§à§ã§Ý§Ö§Õ§å§ð§ë§Ö§Ô§à §Õ§à§Ò§Ñ§Ó§Ý§Ö§ß§Ú§ñ §Õ§Ñ§ß§ß§í§ç §ß§Ñ §Ô§â§Ñ§æ§Ú§Ü. (§ß§à§Ó§à§Ô§à §Ô§â§Ñ§æ§Ú§Ü§Ñ)
  hold on;
  plot(diff(interpSpline))
  # §Õ§Ö§Ý§Ñ§Ö§Þ §ß§Ñ§Õ§á§Ú§ã§î §ß§Ñ§Õ §Ô§â§Ñ§æ§Ú§Ü§à§Þ
  title("Diff's of previous results");
  grid on;# §á§à§Ü§Ñ§Ù§í§Ó§Ñ§Ö§Þ §ã§Ö§ä§Ü§å
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
