function[] = FirstTask()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §é§Ú§ã§ä§Ú§Þ §æ§Ú§Ô§å§â§å, §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§à§Ó
  hold off;
  # §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§í§Ö, §Ü§à§ä§à§â§í§Ö §å§Ü§Ñ§Ù§Ñ§ß§í §Ó §å§ã§Ý§à§Ó§Ú§Ú §Ù§Ñ§Õ§Ñ§ß§Ú§ñ
  x = 0.1:0.1:5;
  p = 2.8;
  a = 0.3:0.3:2;
  # §á§â§à§ç§à§Õ§Ú§Þ§ã§ñ §á§à §Ü§Ñ§Ø§Õ§à§Þ§å §ï§Ý§Ö§Þ§Ö§ß§ä§å §á§Ö§â§Ö§Þ§Ö§ß§ß§à§Û a (§é§Ö§â§Ö§Ù §è§Ú§Ü§Ý for §á§à §Õ§Ý§Ú§ß§Ö §Þ§Ñ§ã§ã§Ú§Ó§Ñ a).
  for k=1:1:length(a)
    # §Õ§Ý§ñ §Ü§Ñ§Ø§Õ§à§Û §á§Ö§â§Ö§Þ§Ö§ß§ß§à§Û a §ß§Ñ§ç§à§Õ§Ú§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö y, §é§Ö§â§Ö§Ù §Ó§ß§Ö§ê§ß§ð§ð §æ§å§ß§Ü§è§Ú§ð fOfFirstTask(x, a, p) §Ú §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü §á§Ö§â§Ö§Õ§Ñ§Ó§Ñ§ñ x, y §Ó plot(x, y)
    plot(x, fOfFirstTask(x, a(k), p));
    hold on; # §ã§à§ç§â§Ñ§ß§ñ§Ö§Þ §Ô§â§Ñ§æ§Ú§Ü
  end; # §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
end; # §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú