function[result] = fOfFourthTask(a, b, t)
  # §á§â§à§ç§à§Õ§Ú§Þ§ã§ñ §á§à §Ü§Ñ§Ø§Õ§à§Þ§å §ï§Ý§Ö§Þ§Ö§ß§ä§å §á§Ö§â§Ö§Þ§Ö§ß§ß§à§Û t (§é§Ö§â§Ö§Ù §è§Ú§Ü§Ý for §á§à §Õ§Ý§Ú§ß§Ö §Þ§Ñ§ã§ã§Ú§Ó§Ñ t). §£§ß§å§ä§â§Ú §è§Ú§Ü§Ý§Ñ §Ù§Ñ§á§à§Ý§ß§ñ§Ö§Þ §Þ§Ñ§ã§ã§Ú§Ó result
  for k=1:1:length(t)
    # §Ö§ã§Ý§Ú t(k) < a, §ä§à result(k) = 5. §¦§ã§Ý§Ú a <= t(k) < b, §ä§à result(k) = (-2.*t(k)) + 1. §£§à §Ó§ã§Ö§ç §à§ã§ä§Ñ§Ý§î§ß§í§ç §ã§Ý§å§é§Ñ§ñ§ç(§Ñ §ä§å§ä §ä§Ü§Ñ§à§Û §ä§à§Ý§î§Ü§à §à§Õ§Ú§ß, §Ü§à§Ô§Õ§Ñ t(k) > b) result(k) = -3 (§ï§ä§à §Õ§à §Ü§à§ß§è§Ñ if..else §Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú §à§á§Ú§ã§Ñ§ß§Ú§Ö)
    if (t(k) < a) result(k) = 5;
    elseif (a <= t(k) < b) result(k) = (-2.*t(k)) + 1;
    else result(k) = -3;
    endif; # §Ü§à§ß§Ö§è if..else §Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú (§Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú §ã §å§ã§Ý§à§Ó§Ú§ñ§Þ§Ú)
  end; # §Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
end; # §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú