function[result, result_maped] = FourthTask()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§í§Ö, §Ü§à§ä§à§â§í§Ö §å§Ü§Ñ§Ù§Ñ§ß§í §Ó §å§ã§Ý§à§Ó§Ú§Ú §Ù§Ñ§Õ§Ñ§ß§Ú§ñ
  t = -5:0.1:5;
  a = -2;
  b = 2;
  min = -2.5;
  max = 3.5;
  # §Ó§í§á§à§Ý§ß§ñ§Ö§Þ §æ§å§ß§Ü§è§Ú§ð, §Ü§à§ä§à§â§Ñ§ñ §å§Ü§Ñ§Ù§Ñ§ß§Ñ §Ó §Ù§Ñ§Õ§Ñ§ß§Ú§Ú. (§ß§å §ä§à§é§ß§Ö§Ö §Þ§í §Ö§× §ã§à§Ù§Õ§Ñ§Ý§Ú §Ó §à§ä§Õ§Ö§Ý§î§ß§à§Þ §æ§Ñ§Û§Ý§Ö §Ó §Ó§Ú§Õ§Ö m-§æ§å§ß§Ü§è§Ú§Ú §Ú §à§ß§Ñ §â§Ñ§Ò§à§ä§Ñ§Ö§ä §Ü§Ñ§Ü §å§Ü§Ñ§Ù§Ñ§ß§à §Ó §Ù§Ñ§Õ§Ñ§ß§Ú§Ú)
  result = fOfFourthTask(a, b, t);
  # §Ó§í§á§à§Ý§ß§ñ§Ö§Þ §Ö§ë§× §â§Ñ§Ù, §ã§à§Ù§Õ§Ñ§Ó§Ñ§ñ §ä§Ö§Þ §ã§Ñ§Þ§í§Þ §Ü§à§á§Ú§ð
  result_maped = fOfFourthTask(a, b, t);
  # §á§â§à§ç§à§Õ§Ú§Þ§ã§ñ §á§à §Ü§Ñ§Ø§Õ§à§Þ§å §ï§Ý§Ö§Þ§Ö§ß§ä§å §á§Ö§â§Ö§Þ§Ö§ß§ß§à§Û result_maped (§é§Ö§â§Ö§Ù §è§Ú§Ü§Ý for §á§à §Õ§Ý§Ú§ß§Ö §Þ§Ñ§ã§ã§Ú§Ó§Ñ result_maped).
  for k=1:1:length(result_maped)
    # §Ö§ã§Ý§Ú result_maped(k) > 3.5, §ä§à §Þ§Ñ§á§Ú§Þ result_maped(k) §Ü 3.5. §¦§ã§Ý§Ú result_maped(k) < 2.5, §ä§à §Þ§Ñ§á§Ú§Þ result_maped(k) §Ü 2.5. (§ï§ä§à §Õ§à §Ü§à§ß§è§Ñ if..else §Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú §à§á§Ú§ã§Ñ§ß§Ú§Ö)
    if (result_maped(k) < min) 
      result_maped(k) = min;
    else if (result_maped(k) > max) 
      result_maped(k) = max;
    endif; # §Ü§à§ß§Ö§è if..else §Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú (§Ü§à§ß§ã§ä§â§å§Ü§è§Ú§Ú §ã §å§ã§Ý§à§Ó§Ú§ñ§Þ§Ú)
  end; #§Ü§à§ß§Ö§è §è§Ú§Ü§Ý§Ñ
  # §é§Ú§ã§ä§Ú§Þ §æ§Ú§Ô§å§â§å, §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§à§Ó, §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü§Ú, §ã§ß§Ñ§é§Ñ§Ý§Ñ §ß§Ñ §à§ã§ß§à§Ó§Ö §à§â§Ú§Ô§Ú§ß§Ñ§Ý§î§ß§í§ç §Õ§Ñ§ß§ß§í§ç, §ã§à§ç§â§Ñ§ß§ñ§Ö§Þ §Ô§â§Ñ§æ§Ú§Ü §Ú §ã§ä§â§à§Ú§Þ §ß§Ñ §à§ã§ß§à§Ó§Ö §á§â§Ö§à§Ò§â§Ñ§Ù§à§Ó§Ñ§ß§ß§í§ç §Õ§Ñ§ß§ß§í§ç. (§Ó§ã§× §ï§ä§à §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à)
  hold off;
  plot(t, result);
  hold on;
  plot(t, result_maped);
end; # §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
