function[result] = SecondTask()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §é§Ú§ã§ä§Ú§Þ §æ§Ú§Ô§å§â§å, §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§Ñ
  hold off;
  # §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§í§Ö, §Ü§à§ä§à§â§í§Ö §å§Ü§Ñ§Ù§Ñ§ß§í §Ó §å§ã§Ý§à§Ó§Ú§Ú §Ù§Ñ§Õ§Ñ§ß§Ú§ñ
  t = 0:0.1:4.*pi;
  a = 5;
  d = 6;
  # §ß§Ñ§ç§à§Õ§Ú§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö x §Ú y, §é§Ö§â§Ö§Ù §Ó§ß§Ö§ê§ß§Ú§Ö §æ§å§ß§Ü§è§Ú§ð xOfSecondTask(t, a, d) §Ú yOfSecondTask(t, a, d) §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü §á§Ö§â§Ö§Õ§Ñ§Ó§Ñ§ñ x, y §Ó plot(x, y)
  plot(xOfSecondTask(t, a, d), yOfSecondTask(t, a, d));
  # §ã§à§Ù§Õ§Ñ§×§Þ §ß§à§Ó§å§ð §æ§Ú§Ô§å§â§å §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§Ñ
  figure();
  # §ß§Ñ§ç§à§Õ§Ú§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö x §Ú y, §é§Ö§â§Ö§Ù §Ó§ß§Ö§ê§ß§Ú§Ö §æ§å§ß§Ü§è§Ú§ð xOfSecondTask(t, a, d) §Ú yOfSecondTask(t, a, d) §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü §á§Ö§â§Ö§Õ§Ñ§Ó§Ñ§ñ x, y, t §Ó plot3(x, y, z)
  plot3(xOfSecondTask(t, a, d), yOfSecondTask(t, a, d), t);
end; # §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú