function[] = ThirdTask()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §é§Ú§ã§ä§Ú§Þ §æ§Ú§Ô§å§â§å, §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§à§Ó
  hold off;
  # §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§í§Ö, §Ü§à§ä§à§â§í§Ö §å§Ü§Ñ§Ù§Ñ§ß§í §Ó §å§ã§Ý§à§Ó§Ú§Ú §Ù§Ñ§Õ§Ñ§ß§Ú§ñ
  x = -2:0.1:2;
  y = -1:0.1:1;
  # §¶§å§ß§Ü§è§Ú§ñ meshgrid() §ã§à§Ù§Õ§Ñ§Ö§ä §ã§á§Ú§ã§à§Ü §Þ§Ñ§ã§ã§Ú§Ó§à§Ó §Ü§à§à§â§Õ§Ú§ß§Ñ§ä§ß§í§ç §ã§Ö§ä§à§Ü N-§Þ§Ö§â§ß§à§Ô§à §Ü§à§à§â§Õ§Ú§ß§Ñ§ä§ß§à§Ô§à §á§â§à§ã§ä§â§Ñ§ß§ã§ä§Ó§Ñ §Õ§Ý§ñ §å§Ü§Ñ§Ù§Ñ§ß§ß§í§ç §à§Õ§ß§à§Þ§Ö§â§ß§í§ç §Þ§Ñ§ã§ã§Ú§Ó§à§Ó §Ü§à§à§â§Õ§Ú§ß§Ñ§ä§ß§í§ç §Ó§Ö§Ü§ä§à§â§à§Ó.
  # §¬§à§à§â§Õ§Ú§ß§Ñ§ä§ß§à§Ö §á§â§à§ã§ä§â§Ñ§ß§ã§ä§Ó§à - §ï§ä§à §á§â§à§ã§ä§â§Ñ§ß§ã§ä§Ó§à N-§Þ§Ö§â§ß§í§ç §ä§à§é§Ö§Ü-§Ü§à§à§â§Õ§Ú§ß§Ñ§ä, §á§â§Ú§é§Ö§Þ §Ü§Ñ§Ø§Õ§à§Û §ä§à§é§Ü§Ö §Ó §ä§Ñ§Ü§à§Þ §á§â§à§ã§ä§â§Ñ§ß§ã§ä§Ó§Ö §ã§à§à§ä§Ó§Ö§ä§ã§ä§Ó§å§Ö§ä §Ü§à§Þ§Ò§Ú§ß§Ñ§è§Ú§ñ §à§Õ§ß§à§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §Ú§Ù §Ü§Ñ§Ø§Õ§à§Ô§à §Ü§à§à§â§Õ§Ú§ß§Ñ§ä§ß§à§Ô§à §Þ§Ñ§ã§ã§Ú§Ó§Ñ.
  [X, Y] = meshgrid(x, y);
  # §ã§ä§â§à§Ú§Þ §Ô§â§Ñ§æ§Ú§Ü §Ó 3-§×§ç §Þ§Ö§â§ß§à§Þ §á§â§à§ã§ä§â§Ñ§ß§ã§ä§Ó§Ö. (§Ü§Ñ§Ü Z §Ò§Ö§â§×§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ §á§à§ã§Ý§Ö §Ó§í§Ù§à§Ó§Ñ fOfThirdTask §æ§å§ß§Ü§è§Ú§Ú)
  plot3(X, Y, fOfThirdTask(X, Y));
end; # §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú