# n - §é§Ú§ã§Ý§à
# x - §é§Ú§ã§Ý§à
function[S] = recFunForTask2(n, x)
  # §¦§ã§Ý§Ú n §ß§Ö §â§Ñ§Ó§Ö§ß 1-§è§Ö, §ä§à §Ó§í§Ù§í§Ó§Ñ§Ö§Þ §á§â§Ú§ã§Ó§Ñ§Ú§Ó§Ñ§Ö§Þ §á§Ö§â§Ö§Þ§Ö§ß§ß§à§Û S §ß§Ñ§ê§å §Ø§Ö §æ§å§ß§Ü§è§Ú§ð §ã §Ñ§â§Ô§å§Þ§Ö§ß§ä§Ñ§Þ§Ú n-1 §Ú x + §æ§à§â§Þ§å§Ý§å §Ú§Ù §å§ã§Ý§à§Ó§Ú§ñ §ã §ß§í§ß§Ö§ê§ß§Ú§Þ§Ú §Ù§ß§Ñ§é§Ö§ß§Ú§ñ§Þ§Ú.
  # (§ß§à §ß§Ñ§ê§å §æ§å§ß§Ü§è§Ú§ð §Ó§í§Ù§Ó§Ñ§Ö§Þ §ã §é§Ú§ã§Ý§à§Þ §ß§Ñ §Ö§Õ§Ú§ß§Ú§è§å §Þ§Ö§ß§î§ê§Ö)
  # §¬§Ñ§Ü §ä§à§Ý§î§Ü§à §Ù§ß§Ñ§é§Ö§ß§Ú§Ö §â§Ñ§Ó§ß§à 1-§è§Ö, §ä§Ñ§Ü §ã§â§Ñ§Ù§å §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§Þ §Ó S §ä§à§Ý§î§Ü§à §æ§à§â§Þ§å§Ý§å §Ú§Ù §å§ã§Ý§à§Ó§Ú§ñ §ã §ß§í§ß§Ö§ê§ß§Ú§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö§Þ. (§ß§í§ß§Ö§ê§ß§Ö§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö == 1)
  # §¯§Ñ §Ö§Õ§Ú§ß§Ú§è§Ö §ß§Ö §Ó§í§Ù§í§Ó§Ñ§Ö§Þ §ß§Ñ§ê§å §Ø§Ö §æ§å§ß§Ü§è§Ú§ð §Ö§ë§× §â§Ñ§Ù §Ú§Ù-§Ù§Ñ §å§ã§Ý§à§Ó§Ú§ñ §Ó §Ù§Ñ§Õ§Ñ§é§Ö, §é§ä§à §ã§å§Þ§Þ§Ñ §Õ§à§Ý§Ø§ß§Ñ §ß§Ñ§é§Ú§ß§Ñ§ä§î§ã§ñ §ã§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ 1. (k = 1 §á§â§à§ë§Ö §Ô§à§Ó§à§â§ñ)
  if (n ~= 1)
    S = recFunForTask2(n-1, x) + (((-1).^(n+1)) .* ((n+1)./factorial(n)) .* (x.^n))
  else S = ((-1).^(n+1)) .* ((n+1)./factorial(n)) .* (x.^n)
  endif;# §Ü§à§ß§Ö§è §å§ã§Ý§à§Ó§Ú§ñ
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
