function[R1, R2] = task2()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §ã§à§Ù§Õ§Ñ§×§Þ §Õ§Ñ§ß§ß§í§Ö §Õ§Ý§ñ x. (§ä§Ñ§Ü §Ü§Ñ§Ü §ß§Ñ§Þ §ß§Ö §ã§Ü§Ñ§Ù§Ñ§ß§à §Ü§Ñ§Ü§Ú§Ö, §ä§à §ñ §ã§Õ§Ö§Ý§Ñ§Ý §à§ä 0 §Õ§à 10 §ã §ê§Ñ§Ô§à§Þ 0.1)
  x = 0:0.1:10 
  # §Ó§í§Ù§í§Ó§Ñ§Ö§Þ §á§Ö§â§Ó§å§ð §æ§å§ß§Ü§è§Ú§ð §Ú§Ù §Ù§Ñ§Õ§Ñ§é§Ú
  R1 = defFunForTask2(x)
  # §Ó§í§Ù§í§Ó§Ñ§Ö§Þ §Ó§ä§à§â§å§ð §æ§å§ß§Ü§è§Ú§ð §Ú§Ù §Ù§Ñ§Õ§Ñ§é§Ú. (§ã§ä§Ö§á§Ö§ß§ß§à§Û §â§ñ§Õ, §Ü§à§ä§à§â§í§Û §ñ§Ó§Ý§ñ§Ö§ä§ã§ñ §Ñ§á§á§â§à§Ü§ã§Ú§Þ§Ñ§è§Ú§Ö§Û §á§Ö§â§Ó§à§Û §æ§å§ß§Ü§è§Ú§Ú)
  # 36 - §£§à§Ý§ê§Ö§Ò§ß§Ñ§ñ §Ü§à§ß§ã§ä§Ñ§ß§ä§Ñ, §Ü§à§ä§à§â§Ñ§ñ §Ò§í§Ý§Ñ §á§à§Õ§à§Ò§â§Ñ§ß§Ñ §é§Ö§Ý§à§Ó§Ö§Ü§à§Þ §Ó§â§å§é§ß§å§ð §é§Ö§â§Ö§Ù §á§â§à§ã§Þ§à§ä§â §Ù§ß§Ñ§é§Ö§ß§Ú§Û R1 §Ú R2 (§ß§å §Ú §ß§Ñ §Ô§â§Ñ§æ§Ú§Ü §ã§Þ§à§ä§â§Ö§Ý)
  R2 = recFunForTask2(36, x)
  # §á§â§à§Ó§Ö§â§ñ§Ö§Þ §Ô§Õ§Ö §Õ§Ñ§ß§ß§í§Ö 1 §Ó 1 §ã§à§Ó§á§Ñ§Õ§Ñ§ð§ä. (§Ó§í§Ó§à§Õ §Þ§Ñ§ã§ã§Ú§Ó§Ñ §ã 0-§Þ§ñ (§ß§Ö §â§Ñ§Ó§ß§í) §Ú 1-§Þ§Ú(§â§Ñ§Ó§ß§í))
  disp(R1 == R2)
  # §Ó§í§Ó§à§Õ§Ú§Þ §Þ§Ñ§ã§ã§Ú§Ó §Õ§Ý§ñ §á§â§à§Ó§Ö§â§Ü§Ú §é§Ú§ã§Ö§Ý §Ô§Ý§Ñ§Ù§Ñ§Þ§Ú
  disp("R1")
  disp(R1)
  disp("R2")
  disp(R2)
  # §é§Ú§ã§ä§Ú§Þ §æ§Ú§Ô§å§â§å, §Õ§Ý§ñ §â§Ú§ã§à§Ó§Ñ§ß§Ú§ñ §Ô§â§Ñ§æ§Ú§Ü§à§Ó
  hold off
  # §â§Ú§ã§å§Ö§Þ §á§Ö§â§Ó§í§Û §Ô§â§Ñ§æ§Ú§Ü, §ã§à§ç§â§Ñ§ß§ñ§Ö§Þ §Õ§Ñ§ß§ß§í§Ö §á§à§ã§ä§â§à§Ö§ß§ß§à§Ô§à §Ô§â§Ñ§æ§Ú§Ü§Ñ, §ã§ä§â§à§Ú§Þ §Ó§ä§à§â§à§Û §Ô§â§Ñ§æ§Ú§Ü
  plot(R1)
  hold on
  plot(R2)
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú
