function[isInsideFunction] = task3()
  # §é§Ú§ã§ä§Ú§Þ §à§ä §Ý§Ú§ê§ß§Ú§ç §Õ§Ñ§ß§ß§í§ç
  clear;
  # §±§à§Ý§å§é§Ñ§Ö§Þ §é§Ú§ã§Ý§Ñ §ã §Ü§Ý§Ñ§Ó§Ú§Ñ§ä§å§â§í §Ú §á§â§Ú§ã§Ó§Ñ§Ú§Ó§Ñ§Ö§Þ §á§Ö§â§Þ§Ö§ß§ß§í§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ
  x = input("§£§Ó§Ö§Õ§Ú§ä§Ö x: ")
  y = input("§£§Ó§Ö§Õ§Ú§ä§Ö y: ")
  # §¥§Ö§Ý§Ñ§Ö§Þ §æ§Ý§Ñ§Ô, §Ó §Ü§à§ä§à§â§í§Û §Þ§í §å§ã§ä§Ñ§ß§Ñ§Ó§Ý§Ú§Ó§Ñ§Ö§Þ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ true/false(§á§à§á§Ñ§Õ§Ñ§Ö§ä/§ß§Ö §á§à§á§Ñ§Õ§Ñ§Ö§ä §Ó §Ù§Ñ§Õ§Ñ§ß§ß§å§ð §à§Ò§Ý§Ñ§ã§ä§î §ß§Ñ §á§Ý§à§ã§Ü§à§ã§ä§Ú).
  # §±§à §å§Þ§à§Ý§é§Ñ§ß§Ú§ð §ã§ä§Ñ§Ó§Ú§Þ true(§á§à§á§Ñ§Õ§Ñ§Ö§ä)
  isInsideFunction = true
  # §±§â§à§Ó§Ö§â§ñ§Ö§Þ §ß§Ñ §ä§à, §á§à§á§Ñ§Õ§Ñ§ð§ä §Ý§Ú §ß§Ñ§ê§Ú §ä§à§é§Ü§Ú §Ó §à§Ò§Ý§Ñ§ã§ä§î §ß§Ö §Ù§Ñ§Õ§Ñ§ß§ß§å§ð, §Ö§ã§Ý§Ú §á§à§á§Ñ§Õ§Ñ§ð§ä, §ä§à §Ù§Ñ§ç§à§Õ§Ú§Þ §Ó §Ò§Ý§à§Ü §å§ã§Ý§à§Ó§Ú§ñ §Ú §ã§ä§Ñ§Ó§Ú§Þ §æ§Ý§Ñ§Ô§å §Ù§ß§Ñ§é§Ö§ß§Ú§Ö false(§ß§Ö §á§à§á§Ñ§Õ§Ñ§Ö§ä)
  if (~((x > -1 && x < 1) && (y > -1 && y < 1)) || ((x .^ 2 + (y - 1) .^ 2) < 1) || ((x .^ 2 + (y + 1) .^ 2) < 1))
    isInsideFunction = false
  endif;# §Ü§à§ß§Ö§è if..else §Ò§Ý§à§Ü§Ñ
  # §¥§Ö§Ý§Ñ§Ö§Þ §á§â§à§Ó§Ö§â§Ü§å §ã§à§ã§ä§à§ñ§ß§Ú§ñ §æ§Ý§Ñ§Ô§Ñ. §³§à§à§ä§Ó§Ö§ä§ã§ä§Ó§Ö§ß§ß§à §Ö§ã§Ý§Ú true, §ä§à §Ó§í§Ó§à§Õ§Ú§Þ §é§ä§à §Ó§ç§à§Õ§Ú§ä, §Ú§ß§Ñ§é§Ö §Ó§í§Ó§à§Õ§Ú§Þ §é§ä§à §ß§Ö §Ó§ç§à§Õ§Ú§ä.
  if (isInsideFunction) disp("§£§ç§à§Õ§Ú§ä") else disp("§¯§Ö §Ó§ç§à§Õ§Ú§ä") endif;# §Ü§à§ß§Ö§è if..else §Ò§Ý§à§Ü§Ñ
end;# §Ü§à§ß§Ö§è §æ§å§ß§Ü§è§Ú§Ú